farmertan81/Spot-Welder/STM32G474CE/src/main.c
    /* SAFETY: INA226 failure → charger OFF */
    if (!ina226_ok) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* DISARMED → charger OFF */
    if (!armed) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* WELDING → charger OFF */
    if (welding_now) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* NORMAL HYSTERESIS CONTROL */
    if (ina_vpack >= CHG_VPACK_OFF) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
    } else if (ina_vpack <= CHG_VPACK_ON) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_SET);
        charger_enabled = true;
    }
}

/* ============ UART Status Packets (split into two for ESP32 parsing)
 * ============ */

static void sendStatusPacket(void) {
    char buf[192];

    /* --- Packet 1: STATUS (system state, ADC-based diagnostics) --- */
    float vcap = readCapVoltage();
    float power_f = (float)weld_power_pct;
    snprintf(buf, sizeof(buf),
             "STATUS,armed=%d,ready=%d,welding=%d,vcap=%.2f,"
             "temp=%.2f,mode=%d,power=%.2f,vdda=%.3f",
             armed ? 1 : 0, system_ready ? 1 : 0, welding_now ? 1 : 0, vcap,
             temp_filtered_c, (int)weld_mode, power_f, measured_vdda);
    uartSend(buf);

    /* --- Packet 2: STATUS2 (INA226 telemetry) --- */
    snprintf(buf, sizeof(buf),
             "STATUS2,ina_ok=%d,chg_en=%d,vpack=%.2f,vlow=%.2f,"
             "vmid=%.2f,cell1=%.2f,cell2=%.2f,cell3=%.2f,ichg=%.2f",
             ina226_ok ? 1 : 0, charger_enabled ? 1 : 0, ina_vpack, vlow, vmid,
             ina_cell1, ina_cell2, ina_cell3, ina_ichg);
    uartSend(buf);
}

/* ============ Shunt Sensing Functions ============ */
static uint32_t adcReadFast(uint32_t channel) {
    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_6CYCLES_5;  // Speed for pulses
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) return 0xFFFF;
    HAL_ADC_Start(&hadc1);
    if (HAL_ADC_PollForConversion(&hadc1, 1) != HAL_OK) {
        HAL_ADC_Stop(&hadc1);
        return 0xFFFF;
    }
    uint32_t val = HAL_ADC_GetValue(&hadc1);
    HAL_ADC_Stop(&hadc1);
    return val;
}

static float capturePulseAmps(uint16_t ms) {
    uint32_t peak_raw = 0;
    uint64_t sum_raw = 0;
    uint32_t count = 0;

    uint32_t start = HAL_GetTick();

    while ((HAL_GetTick() - start) < ms) {
        uint32_t p = adcReadFast(ADC_CHANNEL_2);
        uint32_t n = adcReadFast(ADC_CHANNEL_3);

        if (p != 0xFFFF && n != 0xFFFF) {
            int32_t diff = (int32_t)p - (int32_t)n;
            uint32_t abs_diff = (diff < 0) ? -diff : (uint32_t)diff;

            // ✅ peak (unchanged)
            if (abs_diff > peak_raw) peak_raw = abs_diff;

            // ✅ NEW: accumulate
            sum_raw += abs_diff;
            count++;
        }
    }

    cal_adc_peak_raw = peak_raw;

    float v_per_count = measured_vdda / 4095.0f;

    float v_adc = (float)peak_raw * v_per_count;

    float v_shunt = v_adc / SHUNT_GAIN;

    float peak_current = v_shunt / SHUNT_EFF_OHMS;

    float avg_current = 0.0f;

    if (count > 0) {
        float avg_raw = (float)sum_raw / (float)count;
        float v_adc_avg = avg_raw * v_per_count;
        float v_shunt_avg = v_adc_avg / SHUNT_GAIN;
        avg_current = v_shunt_avg / SHUNT_EFF_OHMS;
    }

    // ✅ keep peak tracking
    if (peak_current > current_peak_amps) current_peak_amps = peak_current;

    // ✅ store average for later use
    cal_current_avg = avg_current;

    return peak_current;
}

/* ============ Helpers ============ */
static void uartSend(const char* s) {
    HAL_UART_Transmit(&huart1, (uint8_t*)s, (uint16_t)strlen(s), 50);
    HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n", 2, 50);
}

static inline void pwmOff(void) {
    __HAL_TIM_SET_COMPARE(&htim1, WELD_TIM_CH, 0);
}

static inline void pwmOnDuty(uint16_t duty) {
    if (duty > PWM_MAX) duty = PWM_MAX;

    uint32_t ccr =
        ((uint32_t)duty * (uint32_t)(TIM1_ARR + 1U)) / (uint32_t)(PWM_MAX + 1U);
    if (ccr > TIM1_ARR) ccr = TIM1_ARR;

    __HAL_TIM_SET_COMPARE(&htim1, WELD_TIM_CH, ccr);
}

static bool contactDetectedRaw(float* out_vcap) {
    float vcap = readCapVoltage();
    if (out_vcap != NULL) {
        *out_vcap = vcap;
    }

    return (vcap > g_contact_threshold_v);
}

static bool contactDetected(void) {
    uint32_t now = HAL_GetTick();

    if ((now - g_contact_last_sample_ms) < CONTACT_SAMPLE_MS) {
        return g_contact_state;
    }
    g_contact_last_sample_ms = now;

    bool current_raw = contactDetectedRaw(&g_contact_last_vcap);

    if (!current_raw) {
        g_contact_state = false;
        g_contact_pending_high = false;
        g_contact_pending_since_ms = 0;
        return g_contact_state;
    }

    if (g_contact_state) {
        return true;
    }

    if (!g_contact_pending_high) {
        g_contact_pending_high = true;
        g_contact_pending_since_ms = now;
        return false;
    }

    if ((now - g_contact_pending_since_ms) >= CONTACT_DEBOUNCE_MS) {
        g_contact_state = true;
    }

    return g_contact_state;
}

static void clampParams(void) {
    if (weld_mode < 1) weld_mode = 1;
    if (weld_mode > 3) weld_mode = 3;

    if (weld_d1_ms > MAX_WELD_MS) weld_d1_ms = MAX_WELD_MS;
    if (weld_d2_ms > MAX_WELD_MS) weld_d2_ms = MAX_WELD_MS;
    if (weld_d3_ms > MAX_WELD_MS) weld_d3_ms = MAX_WELD_MS;

    if (weld_power_pct < 50) weld_power_pct = 50;
    if (weld_power_pct > 100) weld_power_pct = 100;

    if (preheat_pct > 100) preheat_pct = 100;
    if (preheat_ms > MAX_WELD_MS) preheat_ms = MAX_WELD_MS;

    if (trigger_mode < 1) trigger_mode = 1;
    if (trigger_mode > 2) trigger_mode = 2;

    if (contact_hold_steps < 1) contact_hold_steps = 1;
    if (contact_hold_steps > 10) contact_hold_steps = 10;
}

static void applyArmTimeout(void) {
    if (ARM_TIMEOUT_MS == 0) return;
    if (!armed) return;
    if (armed_until_ms == 0) return;

    uint32_t now = HAL_GetTick();
    if ((int32_t)(now - armed_until_ms) >= 0) {
        armed = false;
        armed_until_ms = 0;
        uartSend("EVENT,ARM_TIMEOUT");
    }
}

static void applyReadyTimeout(void) {
    if (!system_ready) return;
    if (READY_TIMEOUT_MS == 0) return;

    uint32_t now = HAL_GetTick();
    if ((int32_t)(now - ready_until_ms) >= 0) {
        system_ready = false;
        ready_until_ms = 0;
        uartSend("EVENT,READY_TIMEOUT");
    }
}

static uint16_t pctToDuty(uint8_t pct) {
    if (pct >= 100) return PWM_MAX;
    return (uint16_t)((uint32_t)pct * PWM_MAX / 100U);
}

