farmertan81/Spot-Welder/STM32G474CE/src/main.c
    if (strncmp(line, "SET_CONTACT_THRESH,", 19) == 0) {
        float v = strtof(line + 19, NULL);
        if (v < 0.1f) v = 0.1f;
        if (v > 9.0f) v = 9.0f;
        g_contact_threshold_v = v;
        g_contact_state = false;
        g_contact_pending_high = false;
        g_contact_pending_since_ms = 0;
        snprintf(response, sizeof(response), "ACK,SET_CONTACT_THRESH,%.2f",
                 g_contact_threshold_v);
        uartSend(response);
        return;
    }

    if (strncmp(line, "SET_CONTACT_HOLD,", 17) == 0) {
        int v = atoi(line + 17);
        if (v < 1) v = 1;
        if (v > 10) v = 10;
        contact_hold_steps = (uint8_t)v;

        snprintf(response, sizeof(response), "ACK,SET_CONTACT_HOLD,steps=%d",
                 contact_hold_steps);
        uartSend(response);
        return;
    }

    if (strcmp(line, "CMD,FIRE") == 0) {
        fireRecipe();
        return;
    }

    if (strcmp(line, "CMD,ENABLE") == 0) {
        armed = true;
        uartSend("ACK,ENABLED");
        return;
    }

    if (strcmp(line, "CMD,DISABLE") == 0) {
        armed = false;
        uartSend("ACK,DISABLED");
        return;
    }

    if (strcmp(line, "STATUS") == 0 || strcmp(line, "CMD,STATUS") == 0) {
        /* Send both STATUS and STATUS2 packets on demand */
        sendStatusPacket();
        return;
    }
    if (strcmp(line, "DBG_SHUNT") == 0) {
        uint32_t p = adcReadFast(ADC_CHANNEL_2);
        uint32_t n = adcReadFast(ADC_CHANNEL_3);

        char buf[128];
        snprintf(buf, sizeof(buf), "DBG,SHUNT,p=%lu,n=%lu,diff=%ld,vdda=%.3f",
                 (unsigned long)p, (unsigned long)n,
                 (long)((int32_t)p - (int32_t)n), measured_vdda);

        uartSend(buf);
        return;
    }

    snprintf(response, sizeof(response), "ERR,UNKNOWN_CMD,rx=%s", line);
    uartSend(response);
}

static void pollPedal(void) {
    GPIO_PinState raw = HAL_GPIO_ReadPin(PEDAL_PORT, PEDAL_PIN);
    uint32_t now = HAL_GetTick();

    if (raw != pedal_last_raw) {
        pedal_last_change_ms = now;
        pedal_last_raw = raw;
    }

    if ((now - pedal_last_change_ms) >= PEDAL_DEBOUNCE_MS) {
        if (raw != pedal_stable) {
            GPIO_PinState prev = pedal_stable;
            pedal_stable = raw;

            if (prev == GPIO_PIN_SET && pedal_stable == GPIO_PIN_RESET) {
                uartSend("EVENT,PEDAL_PRESS");
                if (trigger_mode == 1) {
                    fireRecipe();
                }
            }
        }
    }
}

static void pollContactTrigger(void) {
    if (trigger_mode != 2) {
        contact_hold_active = false;
        contact_hold_start_ms = 0;
        contact_fire_lock = false;
        return;
    }

    bool contact_now = contactDetected();
    uint32_t now = HAL_GetTick();
    uint32_t hold_ms_required = (uint32_t)contact_hold_steps * 500U;

    if (!contact_now) {
        contact_hold_active = false;
        contact_hold_start_ms = 0;
        contact_fire_lock = false;
        return;
    }

    if (contact_fire_lock) {
        return;
    }

    if (!contact_hold_active) {
        contact_hold_active = true;
        contact_hold_start_ms = now;
        return;
    }

    if ((now - contact_hold_start_ms) >= hold_ms_required) {
        uartSend("EVENT,CONTACT_TRIGGER");
        fireRecipe();
        contact_fire_lock = true;
    }
}

int main(void) {
    HAL_Init();
    SystemClock_Config();
    SystemCoreClockUpdate();
    HAL_InitTick(TICK_INT_PRIORITY);

    MX_GPIO_Init();

    /* 100ms delay for INA226 power rail stabilization */
    HAL_Delay(100);

    for (int i = 0; i < 3; i++) {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        HAL_Delay(80);
    }

    /* I2C bus recovery before initialization – unstick any hung devices */
    i2c_bus_recovery();

    MX_I2C1_Init(); /* I2C1 for INA226 sensors – graceful, no hang */
    MX_USART1_UART_Init();
    MX_ADC1_Init();
    OPAMP1->CSR &= ~OPAMP_CSR_OPAMPxEN;
    MX_ADC2_Init(); /* ADC2 for PA4 (AMC1311B OUTN = ADC2_IN17) */
    MX_TIM1_Init();

    /* Initial VDDA calibration using VREFINT */
    measured_vdda = measureVDDA();

    HAL_TIM_PWM_Start_IT(&htim1, TIM_CHANNEL_1);
    pwmOff();

    boot_ms = HAL_GetTick();

    /* Always boot in PEDAL trigger mode (MODE=1). Runtime switching is allowed,
     * but mode is intentionally non-persistent and resets to PEDAL after
     * reboot. */
    trigger_mode = 1;

    g_contact_threshold_v = CONTACT_THRESHOLD_V_DEFAULT;
    g_contact_state = false;
    g_contact_pending_high = false;
    g_contact_pending_since_ms = 0;
    g_contact_last_sample_ms = 0;
    g_contact_last_vcap = 0.0f;
    GPIO_PinState r = HAL_GPIO_ReadPin(PEDAL_PORT, PEDAL_PIN);
    pedal_last_raw = r;
    pedal_stable = r;
    pedal_last_change_ms = boot_ms;

    /* NEW: Initialize INA226 sensors */
    {
        /* INA226 0x40 (pack): reset + configure */
        ina226_write_reg(INA226_ADDR_PACK, INA226_REG_CONFIG, 0x8000);
        HAL_Delay(20);
        /* CONFIG: AVG=16, VBUSCT=1.1ms, VSHCT=1.1ms, MODE=cont shunt+bus */
        uint16_t ina_config = (0x02 << 9) | (0x04 << 6) | (0x04 << 3) | 0x07;
        ina226_write_reg(INA226_ADDR_PACK, INA226_REG_CONFIG, ina_config);
        HAL_Delay(10);
        /* Calibration register (same as ESP32 used) */
        ina226_write_reg(INA226_ADDR_PACK, INA226_REG_CALIBRATION, 41967);
        HAL_Delay(10);

        /* INA226 0x41 (node1): reset + configure (bus voltage only) */
        ina226_write_reg(INA226_ADDR_NODE1, INA226_REG_CONFIG, 0x8000);
        HAL_Delay(20);
        ina226_write_reg(INA226_ADDR_NODE1, INA226_REG_CONFIG, ina_config);
        HAL_Delay(10);

        /* INA226 0x44 (node2): reset + configure (bus voltage only) */
        ina226_write_reg(INA226_ADDR_NODE2, INA226_REG_CONFIG, 0x8000);
        HAL_Delay(20);
        ina226_write_reg(INA226_ADDR_NODE2, INA226_REG_CONFIG, ina_config);
        HAL_Delay(10);

        /* Initial read to populate values */
        ina226_read_all();
    }

    uartSend("BOOT,STM32G474_WELD_BRAIN_10KHZ_READY");

    {
        char boot_mode_msg[32];
        snprintf(boot_mode_msg, sizeof(boot_mode_msg), "BOOT,MODE=%d",
                 (int)trigger_mode);
        uartSend(boot_mode_msg);
    }

