farmertan81/Spot-Welder/STM32G474CE/src/main.c
    HAL_UART_Receive_IT(&huart1, &rx_byte, 1);

    while (1) {
        pollPedal();
        pollContactTrigger();
        applyArmTimeout();
        applyReadyTimeout();

        {
            static int last_contact_dbg = -1;
            int c = contactDetected() ? 1 : 0;
            if (c != last_contact_dbg) {
                last_contact_dbg = c;
                char cbuf[96];
                snprintf(cbuf, sizeof(cbuf), "DBG,CONTACT=%d,vcap=%.2f,th=%.2f",
                         c, g_contact_last_vcap, g_contact_threshold_v);
                uartSend(cbuf);
            }
        }

        {
            static uint32_t last_temp_ms = 0;
            uint32_t now = HAL_GetTick();
            if ((now - last_temp_ms) >= 1000) {
                last_temp_ms = now;

                /* Refresh VDDA calibration every 1s alongside temperature */
                measured_vdda = measureVDDA();

                float t = readThermistor();
                if (t > -50.0f && t < 200.0f) {
                    temp_filtered_c = (0.1f * t) + (0.9f * temp_filtered_c);
                }
            }
        }

        /* NEW: INA226 read + charger state machine @ ~100ms interval */
        {
            static uint32_t last_ina_ms = 0;
            uint32_t now = HAL_GetTick();
            if ((now - last_ina_ms) >= 100) {
                last_ina_ms = now;
                ina226_read_all();
                chargerStateMachine();
            }
        }

        /* Send STATUS + STATUS2 packets every 500ms */
        {
            static uint32_t last_chgstat_ms = 0;
            uint32_t now = HAL_GetTick();
            if ((now - last_chgstat_ms) >= 500) {
                last_chgstat_ms = now;
                sendStatusPacket();
            }
        }

        if (rx_line_ready) {
            char local_line[RX_LINE_MAX];
            __disable_irq();
            memcpy(local_line, rx_ready, sizeof(local_line));
            rx_line_ready = false;
            __enable_irq();
            parseCommand(local_line);
        }

#if DEBUG_UART_RX
        {
            static uint32_t last_health = 0;
            uint32_t now = HAL_GetTick();
            if (now - last_health >= 5000) {
                last_health = now;
                char hb[128];
                snprintf(hb, sizeof(hb),
                         "RXHEALTH,bytes=%lu,errors=%lu,overruns=%lu",
                         (unsigned long)uart_rx_bytes,
                         (unsigned long)uart_rx_errors,
                         (unsigned long)uart_rx_overruns);
                uartSend(hb);

                if (huart1.RxState == HAL_UART_STATE_READY) {
                    HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
                    uartSend("RXHEALTH,REARM");
                }
            }
        }
#endif
    }
}

void SysTick_Handler(void) {
    HAL_IncTick();
    HAL_SYSTICK_IRQHandler();
}

void USART1_IRQHandler(void) { HAL_UART_IRQHandler(&huart1); }

/**
 * @brief Timer Period Elapsed Callback - Forces FETs off
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim) {
    if (htim->Instance == TIM1) {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0);
        HAL_TIM_PWM_Stop_IT(&htim1, TIM_CHANNEL_1);
    }
}

/**
 * @brief TIM1 Update Interrupt Handler
 */
void TIM1_UP_TIM16_IRQHandler(void) { HAL_TIM_IRQHandler(&htim1); }